Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: It uses `clone()` instead of `fork()` to spawn the child process on Linux (`clone()` is not available on Cygwin and Mac), as `fork()` is more likely to cause the child to hang when the parent process has multiple threads.
it_it: Usa `clone()` invece di `fork()` per lo spawn del processo figlio su Linux (`clone()` non è disponibile su Cygwin né su Mac), in quanto `fork()` è più probabile che causi il blocco [hang] del figlio quando il processo genitore ha più thread.

source: It uses a lambda for conciseness:
it_it: Utilizza un lambda per concisione:

source: It was inspired by jMock and EasyMock, but designed with C++'s specifics in mind.
it_it: È stato ispirato da jMock e EasyMock, ma progettato pensando alle specifiche del C++.

source: It was reasonable that someone wanted to write EXPECT_EQ(NULL, some_expression), and this indeed was requested several times.
it_it: Era ragionevole che qualcuno volesse scrivere EXPECT_EQ(NULL, some_expression), e in effetti questo è stato richiesto più volte.

source: It was reasonable that someone wanted to write `EXPECT_EQ(NULL, some_expression)`, and this indeed was requested several times.
it_it: Era ragionevole che qualcuno volesse scrivere `EXPECT_EQ(NULL, some_expression)`, e in effetti questo è stato richiesto più volte.

source: It will be convenient to have a wrapper for this:
it_it: Sarà conveniente avere un wrapper per questo:

source: It will even work with container types yet to be written - as long as they follows the above pattern.
it_it: Funzionerà anche con i tipi di container ancora da scrivere, purché seguano lo schema sopra riportato.

source: It will eventually time-out and fail, but it will take longer and be slightly harder to debug.
it_it: Alla fine andrà in timeout e fallirà, ma richiederà più tempo e sarà leggermente più difficile eseguire il debug.

source: It will include a stack trace in "uninteresting call" warnings.
it_it: Includerà uno stack trace nei warning "uninteresting call".

source: It will use the definition from the class the constructor of which is currently executing.
it_it: Utilizzerà la definizione della classe il cui costruttore è attualmente in esecuzione.

source: It works as long as the return value can be used as the condition in the statement `if (condition) ...`.
it_it: Funziona fin quando il valore restituito può essere utilizzato come condizione nell'istruzione `if (condition) ...`.

source: It works as long as they can be implicitly converted to the corresponding arguments of the inner action.
it_it: Funziona finché possono essere convertiti implicitamente negli argomenti corrispondenti dell'azione interna.

source: It would be too painful if all your tests are like this.
it_it: Sarebbe troppo laborioso se tutti i test fossero così.

source: It's a bit of work initially, but usually pays for itself quickly.
it_it: Inizialmente C'è un po' di lavoro, ma di solito si ripaga rapidamente.

source: It's OK to register multiple environment objects.
it_it: È consentito registrare più oggetti dell'ambiente.

source: It's a bug that has been fixed in gcc 4.)
it_it: È un bug corretto in gcc 4.)

source: It's a bug that has been fixed in `gcc 4`.)
it_it: È un bug corretto in `gcc 4`.)

source: It's a lot of pain to specify the actions.
it_it: È molto faticoso specificare le azioni.

source: It's a pain to debug a test that succeeds or fails as a result of other tests.
it_it: È seccante eseguire il debug di un test che ha esito positivo o negativo a seconda di altri test.

source: It's all about assertions
it_it: È tutta una questione di asserzioni

source: It's also fine for the callable to take no arguments, ignoring the arguments supplied to the mock function:
it_it: Va bene anche che il callable non accetti argomenti, ignorando gli argomenti forniti alla funzione mock:

source: It's just an FYI.
it_it: E' solo per tua informazione.

source: It's less flexible than After(), but more convenient when you have long chains of sequential calls, as it doesn't require you to come up with different names for the expectations in the chains.
it_it: È meno flessibile di After(), ma più conveniente quando si hanno lunghe catene di chiamate sequenziali, poiché non richiede di trovare nomi diversi per le expectation nelle catene.

source: It's less flexible than `After()`, but more convenient when you have long chains of sequential calls, as it doesn't require you to come up with different names for the expectations in the chains.
it_it: È meno flessibile di `After()`, ma più conveniente quando si hanno lunghe catene di chiamate sequenziali, poiché non richiede di trovare nomi diversi per le expectation nelle catene.

source: It's less likely to make mistakes in this area when using value-parameterized tests.
it_it: È meno probabile che si commettano errori in quest'area quando si utilizzano test con valori parametrizzati.

source: It's likely your test needs to change the states of its global variables.
it_it: È probabile che il test debba modificare gli stati delle sue variabili globali.

source: It's perfectly fine to create threads inside a death test statement; they are executed in a separate process and cannot affect the parent.
it_it: È perfettamente corretto creare thread all'interno di una dichiarazione di death test; vengono eseguiti in un processo separato e non possono influenzare il genitore.

source: It's really up to you the user to decide which is more convenient for you, depending on your particular case.
it_it: È davvero personale decidere quale sia più conveniente, a seconda del caso particolare.

source: It's that simple!
it_it: È così semplice!

source: It's useful to have both positive and negative tests here, so you do both.
it_it: È utile avere sia test positivi che negativi qui, quindi si fanno entrambi.

source: Just as you can do set-up and tear-down at the test level and the test suite level, you can also do it at the test program level.
it_it: Proprio come è possibile eseguire l'impostazione e la dismissione [tear-down] a livello di test e di test suite, è possibile farlo anche a livello di programma di test.

source: Just assign it to a matcher variable and use that variable repeatedly!
it_it: Basta assegnarlo a una variabile matcher e utilizzare quella variabile ripetutamente!

source: Just like matchers, a gMock action object consists of a pointer to a ref-counted implementation object.
it_it: Proprio come i matcher, un oggetto azione gMock è costituito da un puntatore a un oggetto di implementazione con conteggio dei riferimenti.

source: Just making a call to the predefined RUN_ALL_TESTS macro does the trick, as opposed to creating or deriving a separate runner class for test execution.
it_it: Basta effettuare una chiamata alla macro di default RUN_ALL_TESTS per risolvere il problema, invece di creare o derivare una classe runner separata per l'esecuzione del test.

source: Just press <Enter> on one of them and you'll be taken to the offending line.
it_it: Basta premere <Enter> su uno di essi e si verrà indirizzati alla riga incriminata.

source: Just press `<Enter>` on one of them and you'll be taken to the offending line.
it_it: Basta premere `<Enter>` su uno di essi e si verrà indirizzati alla riga incriminata.

source: Just remember that if you don't explicitly set an action in an ON_CALL() or EXPECT_CALL(), the fake will be called upon to do it.:
it_it: Ricordarsi solo che se non si imposta esplicitamente un'azione in una ON_CALL() o in una EXPECT_CALL(), la fake verrà chiamato a farlo.:

source: Just remember that if you don't explicitly set an action in an `ON_CALL()` or `EXPECT_CALL()`, the fake will be called upon to do it.:
it_it: Ricordarsi solo che se non si imposta esplicitamente un'azione in una `ON_CALL()` o in una `EXPECT_CALL()`, la fake verrà chiamato a farlo.:

source: Just tell gMock that it should save a reference to bar, instead of a copy of it.
it_it: Basta dire a gMock che dovrebbe salvare un riferimento a bar, invece di una sua copia.

source: Just tell gMock that it should save a reference to `bar`, instead of a copy of it.
it_it: Basta dire a gMock che dovrebbe salvare un riferimento a `bar`, invece di una sua copia.

source: Keep in mind that argv must terminate with a NULL pointer (i.e. argv[argc] is NULL), which is already the case with the default argv passed to main.
it_it: Da tenere presente che argv deve terminare con un puntatore NULL (cioè argv[argc] è NULL), che è è già il caso con il valore di default di argv passato a main.

source: Keep in mind that `argv` must terminate with a `NULL` pointer (i.e. `argv[argc]` is `NULL`), which is already the case with the default `argv` passed to `main`.
it_it: Da tenere presente che `argv` deve terminare con un puntatore `NULL` (cioè `argv[argc]` è `NULL`), che è già il caso con il valore di default di `argv` passato a `main`.

source: Keep in mind that one doesn't have to verify more than one property in one test.
it_it: Si tenga presente che non è necessario verificare più di una proprietà in un test.

source: Knowing When to Expect {#UseOnCall}
it_it: Quando usare Expect {#UseOnCall}

source: Known Limitations
it_it: Limitazioni Note

source: Later when the thread you create joins the main thread, the thread count decrements by 1, but the manager thread will never be killed, so you still have 2 threads, which means you cannot safely run a death test.
it_it: Successivamente, quando il thread creato va in join al thread principale, il conteggio dei thread diminuisce di 1, ma il thread di gestione non verrà mai killato, quindi si avranno ancora 2 thread, il che significa che non si può eseguire in sicurezza un death test.

source: Learn
it_it: Documentazione

source: Learn about key features for ease of use and production-level deployment
it_it: Scopri le funzionalità chiave per la facilità d'uso e l'implementazione a livello di produzione

source: Legacy Matcher Implementation
it_it: Implementazione di Matcher Legacy

source: Legacy gMock FAQ
it_it: Domande frequenti su gMock Legacy

source: Legacy macro-based Actions
it_it: Action Legacy basate su macro

source: Legacy macro-based parameterized Actions
it_it: Azioni legacy parametrizzate basate su macro

source: Legacy workarounds for move-only types {#LegacyMoveOnly}
it_it: Workarounds legacy per i tipi move-only {#LegacyMoveOnly}

source: Let us now tell pkg-config about the actual sysroot
it_it: Diciamo ora a pkg-config il vero sysroot

source: Let's take a look at how to do so.
it_it: Vediamo come farlo.

source: Let's illustrate the idea using an example.
it_it: Illustriamo l'idea con un esempio.

source: Let's look at an example.
it_it: Diamo un'occhiata a un esempio.

source: Let's look at an example:
it_it: Diamo un'occhiata ad un esempio:

source: Let's say you break the code.
it_it: Mettiamo di avere un codice non funzionante.

source: Let's say you have a CMakeLists.txt along the lines of the one in this tutorial and you try to run cmake.
it_it: Supponiamo che si abbia un CMakeLists.txt sulla falsariga di quello in questo tutorial e si provi a eseguire cmake.

source: Let's say you have a `CMakeLists.txt` along the lines of the one in this tutorial and you try to run `cmake`.
it_it: Supponiamo che si abbia un `CMakeLists.txt` sulla falsariga di quello in questo tutorial e si provi a eseguire `cmake`.

source: Let's see if you've really understood it: what does the following code say?
it_it: Vediamo se è stato ben compreso: cosa dice il seguente codice?

source: Lets users add listeners to track events in GoogleTest.
it_it: Consente agli utenti di aggiungere listener per tenere traccia degli eventi in GoogleTest.

source: Let’s say we are working on a fictional project that lets one post and share snippets called “buzzes”.
it_it: Diciamo che stiamo lavorando a un progetto immaginario che consente di pubblicare e condividere frammenti chiamati “buzzes”.

source: Like Pointwise(m, container), but ignores the order of elements.
it_it: Come Pointwise(m, container), ma ignora l'ordine degli elementi.

source: Like `Pointwise(m, container)`, but ignores the order of elements.
it_it: Come `Pointwise(m, container)`, ma ignora l'ordine degli elementi.

source: Like in a monomorphic matcher, you may explain the match result by streaming additional information to the listener argument in MatchAndExplain().
it_it: Come in un matcher monomorfico, si può spiegare il risultato della corrispondenza trasmettendo informazioni aggiuntive all'argomento listener in MatchAndExplain().

source: Like in a monomorphic matcher, you may explain the match result by streaming additional information to the `listener` argument in `MatchAndExplain()`.
it_it: Come in un matcher monomorfico, si può spiegare il risultato della corrispondenza trasmettendo informazioni aggiuntive all'argomento `listener` in `MatchAndExplain()`.

source: Listing 1.
it_it: Listato 1.

source: Listing 10.
it_it: Listato 10.

source: Listing 11.
it_it: Listato 11.

source: Listing 12.
it_it: Listato 12.

source: Listing 13.
it_it: Listato 13.

source: Listing 14.
it_it: Listato 14.

source: Listing 2 creates a test hierarchy named SquareRootTest and then adds two unit tests, PositiveNos and ZeroAndNegativeNos, to that hierarchy.
it_it: Il Listato 2 crea una gerarchia di test denominata SquareRootTest e poi aggiunge due unit test, PositiveNos e ZeroAndNegativeNos, a tale gerarchia.

source: Listing 2.
it_it: Listato 2.

source: Listing 3.
it_it: Listato 3.

source: Listing 4.
it_it: Listato 4.

source: Listing 5.
it_it: Listato 5.

source: Listing 5 provides an example of running SquareRootTest with gtest_output, gtest_repeat, and gtest_filter.
it_it: Il Listato 5 fornisce un esempio di esecuzione di SquareRootTest con gtest_output, gtest_repeat e gtest_filter.

source: Listing 6.
it_it: Listato 6.

source: Listing 7.
it_it: Listato 7.

source: Listing 8.
it_it: Listato 8.

source: Listing 9.
it_it: Listato 9.

source: Listing Test Names
it_it: Elenco dei Nomi dei Test

source: Logging Additional Information
it_it: Log di Informazioni Aggiuntive

source: Logs a property for the current test, test suite, or entire invocation of the test program.
it_it: Logga una proprietà per il test corrente, la test suite o l'intera invocazione del programma di test.

source: Luckily, you can use a matcher where a unary predicate functor is expected by wrapping it inside the Matches() function.
it_it: Fortunatamente, si può utilizzare un matcher in cui è previsto un funtore del predicato unario racchiudendolo nella funzione Matches().

source: Luckily, you can use a matcher where a unary predicate functor is expected by wrapping it inside the `Matches()` function.
it_it: Fortunatamente, si può utilizzare un matcher in cui è previsto un funtore del predicato unario racchiudendolo nella funzione `Matches()`.

source: MOCK_METHOD(bool, CheckMap, (std::map<int, double>, bool)); // Error!
it_it: MOCK_METHOD(bool, CheckMap, (std::map<int, double>, bool)); // Errore!

source: MOCK_METHOD(bool, CheckMap, (std::map<int, double>, bool)); // Won't compile!
it_it: MOCK_METHOD(bool, CheckMap, (std::map<int, double>, bool)); // Non verrà compilato!

source: MOCK_METHOD(std::pair<bool, int>, GetPair, ()); // Error!
it_it: MOCK_METHOD(std::pair<bool, int>, GetPair, ()); // Errore!

source: MOCK_METHOD(std::pair<bool, int>, GetPair, ()); // Won't compile!
it_it: MOCK_METHOD(std::pair<bool, int>, GetPair, ()); // Non verrà compilato!

source: MOCK_METHOD(void, ~MockFoo, ()); // Won't compile!
it_it: MOCK_METHOD(void, ~MockFoo, ()); // Non compila!

source: MSVC gives me warning C4301 or C4373 when I define a mock method with a const parameter.
it_it: MSVC mi dà un warning C4301 o C4373 quando definisco un metodo mock con un parametro const.

source: Machine #0 runs A.V and B.X.
it_it: La macchina #0 esegue A.V e B.X.

source: Machine #0 runs `A.V` and `B.X`.
it_it: La macchina #0 esegue `A.V` e `B.X`.

source: Machine #1 runs A.W and B.Y.
it_it: La macchina #1 esegue A.W e B.Y.

source: Machine #1 runs `A.W` and `B.Y`.
it_it: La macchina #1 esegue `A.W` e `B.Y`.

source: Machine #2 runs B.Z.
it_it: La macchina #2 esegue B.Z.

source: Machine #2 runs `B.Z`.
it_it: La macchina #2 esegue `B.Z`.

source: Macros
it_it: Le Macro

source: Macros for floating point comparisons
it_it: Macro per confronti in virgola mobile

source: Macros {#macros}
it_it: Le Macro {#macros}

source: Makes no difference.
it_it: Non fa differenza.

source: Makes the mocked method a const method.
it_it: Rende il metodo mock-ato un metodo const.

source: Makes the mocked method a `const` method.
it_it: Rende il metodo mock-ato un metodo `const`.

source: Making a non-virtual function virtual is a big decision.
it_it: Rendere virtuale una funzione non virtuale è una decisione importante.

source: Making the Compilation Faster
it_it: Velocizzare la Compilazione

source: Many built-in actions (WithArgs, WithoutArgs,DeleteArg, SaveArg, ...) could in principle support move-only arguments, but the support for this is not implemented yet.
it_it: Molte azioni native (WithArgs, WithoutArgs,DeleteArg, SaveArg, ...) potrebbero in linea di principio supportare argomenti move-only, ma il supporto per questo non è ancora implementato.

source: Many built-in actions (`WithArgs`, `WithoutArgs`,`DeleteArg`, `SaveArg`, ...) could in principle support move-only arguments, but the support for this is not implemented yet.
it_it: Molte azioni native (`WithArgs`, `WithoutArgs`,`DeleteArg`, `SaveArg`, ...) potrebbero in linea di principio supportare argomenti move-only, ma il supporto per questo non è ancora implementato.

source: Many existing algorithms take predicates as arguments (e.g. those defined in STL's <algorithm> header), and it would be a shame if gMock matchers were not allowed to participate.
it_it: Molti algoritmi esistenti accettano predicati come argomenti (ad esempio quelli definiti nell'header <algorithm> di STL) e sarebbe un peccato se ai matcher gMock non fosse consentito partecipare.

source: Many existing algorithms take predicates as arguments (e.g. those defined in STL's `<algorithm>` header), and it would be a shame if gMock matchers were not allowed to participate.
it_it: Molti algoritmi esistenti accettano predicati come argomenti (ad esempio quelli definiti nell'header `<algorithm>` di STL) e sarebbe un peccato se ai matcher gMock non fosse consentito partecipare.

source: Marks the method with noexcept.
it_it: Contrassegna il metodo con noexcept.

source: Marks the method with override.
it_it: Contrassegna il metodo con override.

source: Marks the method with `noexcept`.
it_it: Contrassegna il metodo con `noexcept`.

source: Marks the method with `override`.
it_it: Contrassegna il metodo con `override`.

source: Marks the method with the given reference qualifier, for example ref(&) or ref(&&).
it_it: Contrassegna il metodo con il qualificatore di riferimento specificato, ad esempio ref(&) o ref(&&).

source: Marks the method with the given reference qualifier, for example `ref(&)` or `ref(&&)`.
it_it: Contrassegna il metodo con il qualificatore di riferimento specificato, ad esempio `ref(&)` o `ref(&&)`.

source: Matchers
it_it: I Matcher

source: Matchers Reference
it_it: Riferimenti ai Matcher

source: Matchers are function objects, and parametrized matchers can be composed just like any other function.
it_it: I matcher sono oggetti funzione e quelli parametrizzati possono essere composti proprio come qualsiasi altra funzione.

source: Matchers enable assertions of this form to read like English and generate informative failure messages.
it_it: I matcher consentono alle asserzioni di questo modulo di leggere l'inglese e generare messaggi informativi di errore.

source: Matchers must have no side-effects {#PureMatchers}
it_it: I matcher non devono avere effetti collaterali {#PureMatchers}

source: Matchers that don't have a parameter or have only one parameter have special types: you can assign Foo() to a FooMatcher-typed variable, and assign Foo(p) to a FooMatcherP<p_type>-typed variable.
it_it: I matcher che non hanno un parametro o ne hanno solo uno hanno tipi speciali: si può assegnare Foo() a una variabile di tipo FooMatcher e assegnare Foo(p) a una variabile di tipo FooMatcherP<p_type>.

source: Matchers that don't have a parameter or have only one parameter have special types: you can assign `Foo()` to a `FooMatcher`-typed variable, and assign `Foo(p)` to a `FooMatcherP<p_type>`-typed variable.
it_it: I matcher che non hanno un parametro o ne hanno solo uno hanno tipi speciali: si può assegnare `Foo()` a una variabile di tipo `FooMatcher` e assegnare `Foo(p)` a una variabile di tipo `FooMatcherP<p_type>`.

source: Matchers {#MatcherList}
it_it: I Matcher {#MatcherList}

source: Matchers: What Arguments Do We Expect?
it_it: I Matcher: Quali Argomenti Ci Aspettiamo?

source: Matches x where x.name() starts with "John ".
it_it: Corrisponde a x dove x.name() inizia con "John ".

source: Matches x where x.number >= 3.
it_it: Corrisponde a x dove x.number >= 3.

source: Matches `x` where `x.name()` starts with `"John "`.
it_it: Corrisponde a `x` dove `x.name()` inizia con `"John "`.

source: Matches `x` where `x.number >= 3`.
it_it: Corrisponde a `x` dove `x.number >= 3`.

source: Matches matcher m1 if cond evaluates to true, else matches m2.
it_it: Corrisponde al matcher m1 se cond restituisce true, altrimenti corrisponde a m2.

source: Matches matcher `m1` if `cond` evaluates to true, else matches `m2`.
it_it: Corrisponde al matcher `m1` se `cond` restituisce true, altrimenti corrisponde a `m2`.

source: Matching Argument Values Exactly
it_it: Matching Esatto dei Valori degli Argomenti

source: Matching Arguments that Are Not Copyable
it_it: Match di Argomenti che Non Sono Copiabili

source: Matching Containers
it_it: Il Matching dei Contenitori

source: Matching Multiple Arguments as a Whole
it_it: Corrispondenza di Più Argomenti come un Tutt'uno

source: Matching the Result of a Function, Functor, or Callback
it_it: Corrispondenza del Risultato di una Funzione, Funtore o Callback

source: Meaning
it_it: Significato

source: Member Matchers
it_it: Matcher di Membri

source: Method in a Class Template
it_it: Metodo in una Classe Template

source: Method with Call Type
it_it: Metodo con un Tipo di Chiamata [Call Type]

source: Method with Call Type in a Class Template
it_it: Metodo con una [Call Type] in una Classe Template

source: Methods in Buzzer may return a unique_ptr<Buzz> or take a unique_ptr<Buzz>.
it_it: I metodi in Buzzer possono restituire un unique_ptr<Buzz> o ricevere un unique_ptr<Buzz>.

source: Methods in `Buzzer` may return a `unique_ptr<Buzz>` or take a `unique_ptr<Buzz>`.
it_it: I metodi in `Buzzer` possono restituire un `unique_ptr<Buzz>` o ricevere un `unique_ptr<Buzz>`.

source: Misc Recipes on Using gMock
it_it: Ricette Varie sull'Uso di gMock

source: Mock Classes
it_it: Classi Mock

source: Mock classes are defined as normal classes, using the MOCK_METHOD macro to generate mocked methods.
it_it: Le classi mock vengono definite come le normali classi, utilizzando la macro MOCK_METHOD per generare metodi mock-ati.

source: Mock classes are defined as normal classes, using the `MOCK_METHOD` macro to generate mocked methods.
it_it: Le classi mock vengono definite come le normali classi, utilizzando la macro `MOCK_METHOD` per generare metodi mock-ati.

source: Mock objects of type T by default behave the same way as NaggyMock<T>.
it_it: Gli oggetti mock di tipo T per default si comportano allo stesso modo di NaggyMock<T>.

source: Mock objects of type `T` by default behave the same way as `NaggyMock<T>`.
it_it: Gli oggetti mock di tipo `T` per default si comportano allo stesso modo di `NaggyMock<T>`.
